app/controllers/frames_controller.rb

  def index
    @frames = Frame.all
---
SELECT "frames".* FROM "frames"

  def destroy
    @frame.destroy
---
DELETE FROM "frames" WHERE "frames"."id" = ?  [["id", 1]]

    def set_frame
      @frame = Frame.find(params[:id])
---
SELECT  "frames".* FROM "frames"  WHERE "frames"."id" = ? LIMIT 1  [["id", 3]]