app/controllers/games_controller.rb

  def create
    @game = Game.new(game_params)

    respond_to do |format|
      if @game.save
        @frame = @game.frames.create(frame_number: @game.current_frame)
---
INSERT INTO "games" ("created_at", "current_frame", "frame_stroke", "total_score", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-02-22 22:37:27.534297"], ["current_frame", 1], ["frame_stroke", 1], ["total_score", 0], ["updated_at", "2015-02-22 22:37:27.534297"]]
INSERT INTO "frames" ("created_at", "frame_number", "game_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-02-23 00:42:40.636865"], ["frame_number", 1], ["game_id", 16], ["updated_at", "2015-02-23 00:42:40.636865"]]

  def bowl
    if !isGameOver

      resetPinsIfNecessary

      # Handle first stroke for all frames
      if @game.frame_stroke == 1 && @game.current_frame <= 10
        @game.bowled_pins = randomizePinCount( 0, 10 )
        @game.pins_left = 10 - @game.bowled_pins

      # Handle second stroke for frames 1 through 9
      elsif @game.frame_stroke == 2 && @game.current_frame < 10
        @game.bowled_pins = randomizePinCount( 0, @game.pins_left )
        @game.pins_left = @game.pins_left - @game.bowled_pins

      # Handle second and third stroke for frame 10
      elsif @game.frame_stroke != 1 && @game.current_frame == 10
        if isLastTurnStrike()  || isLastTurnSpare()
          @game.bowled_pins = randomizePinCount( 0, 10 )
          @game.pins_left = 10 - @game.bowled_pins
        else
          @game.bowled_pins = randomizePinCount( 0, 10 )
          @game.pins_left = 10 - @game.bowled_pins
        end
      end

      markScorecard

      respond_to do |format|
        if @game.save
---
INSERT INTO "frames" ("created_at", "frame_number", "game_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-02-23 03:26:00.000615"], ["frame_number", 2], ["game_id", 33], ["updated_at", "2015-02-23 03:26:00.000615"]]
UPDATE "frames" SET "second_stroke" = '' WHERE "frames"."game_id" = ? AND "frames"."frame_number" = 2  [["game_id", 33]]
UPDATE "games" SET "bowled_pins" = ?, "current_frame" = ?, "frame_stroke" = ?, "pins_left" = ?, "updated_at" = ? WHERE "games"."id" = 62  [["bowled_pins", 2], ["current_frame", 2], ["frame_stroke", 1], ["pins_left", 0], ["updated_at", "2015-02-23 05:29:28.025607"]]